app/views/comments/_comment.html.erb

INSERT INTO "comments" ("content", "user_id", "entry_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "dsadsfdsadsa"], ["user_id", 1], ["entry_id", 3], ["created_at", "2015-11-24 08:17:09.981079"], ["updated_at", "2015-11-24 08:17:09.981079"]]
---
    <h5><%= link_to comment.user.name, comment.user %></h3>
    <h6>Posted <%= time_ago_in_words(comment.created_at) %> ago.</h6>