app/views/entries/_entry.html.erb

        <div class="media" id="entry-comment-<%= entry.id %>">
          <%= render entry.comments.limit(3) %>
          <% if entry.comments.size > 0 %>
---
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 3  [["entry_id", 288]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."entry_id" = ?  [["entry_id", 2]]