app/views/entries/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."entry_id" = ?  [["entry_id", 306]]
---
        <%= render @entry.comments.limit(3) %>
        <% if @entry.comments.size > 0 %>