app/views/users/show.html.erb

SELECT  1 AS one FROM "entries" WHERE "entries"."user_id" = ? LIMIT 1  [["user_id", 2]]
---
  <div class="col-md-8">
    <% if @user.entries.any? %>