app/controllers/comments_controller.rb

  def create
  	@comment = Comment.new
  	@comment.content = params[:value]
  	@comment.user_id = current_user.id
  	@comment.entry_id = params[:entry_id].to_i
  	if @comment.save
      @comments = Entry.find( @comment.entry_id ).comments
---
SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]