app/controllers/comments_controller.rb

  def create
  	@comment = Comment.new
  	@comment.content = params[:value]
  	@comment.user_id = current_user.id
  	@comment.entry_id = params[:entry_id].to_i
  	if @comment.save
      @comments = Entry.find( @comment.entry_id ).comments.limit(3)
---
INSERT INTO "comments" ("content", "user_id", "entry_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "dsdasdsadsadssda"], ["user_id", 1], ["entry_id", 3], ["created_at", "2015-11-24 06:57:50.731036"], ["updated_at", "2015-11-24 06:57:50.731036"]]
SELECT  "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 3  [["entry_id", 6]]

  def destroy
  	@comment = Comment.find(params[:id])
    if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ?  ORDER BY "comments"."created_at" DESC LIMIT 1  [["id", 20]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 20]]