app/controllers/entries_controller.rb

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 1  [["id", 306]]
---
  def show
    @entry = Entry.find(params[:id])

INSERT INTO "entries" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Ha noi mua nay dep qua"], ["body", "GHi nho torng long "], ["user_id", 1], ["created_at", "2015-11-24 03:01:58.166638"], ["updated_at", "2015-11-24 03:01:58.166638"]]
SELECT  "entries".* FROM "entries" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "entries" WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def create
  	@entry = current_user.entries.build(entry_params)
  	if @entry.save

      @feed_items = current_user.feed.paginate(page: params[:page], per_page: 4)

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ?  ORDER BY "entries"."created_at" DESC LIMIT 1  [["id", 0]]
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = ?  ORDER BY "comments"."created_at" DESC  [["entry_id", 6]]
---
  def all_comment
    @entry_id = params[:entry_id]
    @comments = Entry.find(@entry_id).comments